# HasLeaderElbow Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IndependentTag..::..HasLeaderElbow Method
IndependentTag Class See Also
---
Whether the tag's leader that points to the reference has an elbow point or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool HasLeaderElbow(
	Reference referenceTagged
)
```

Visual Basic
---
```text
Public Function HasLeaderElbow ( _
	referenceTagged As Reference _
) As Boolean
```

Visual C++
---
```text
public:
bool HasLeaderElbow(
	Reference^ referenceTagged
)
```

# ### Parameters
referenceTagged
    Type: Autodesk.Revit.DB..::..Reference
# ### Return Value
True if the reference has a leader with an elbow point, or false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The specified reference is not currently tagged. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The tag does not have a leader. |

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace